
#### Terraform Format and Style: `success`
#### Terraform Initialization: `success`
#### Terraform Validation: `success`
#### Terraform Plan: `success`

<details>
<summary>Show Plan</summary>

```

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # time_rotating.day has been deleted
  - resource "time_rotating" "day" {
        id               = "2023-02-18T16:23:50Z"
      - rfc3339          = "2023-02-18T16:23:50Z" -> null
        # (9 unchanged attributes hidden)
    }

  # module.repositories["plugin-sonatype-nexus-security-check"].github_repository.repository has changed
  ~ resource "github_repository" "repository" {
      ~ etag                                    = "W/\"4dcf642dcf5dfa3da0be9e42d71989255f719c1736f13a7e1ab740c2caaa3987\"" -> "W/\"a5c533d11a51e472b61472fc506b9497756fd9a34372b0ec8ef9a4a158eadcf2\""
        id                                      = "plugin-sonatype-nexus-security-check"
        name                                    = "plugin-sonatype-nexus-security-check"
      ~ vulnerability_alerts                    = true -> false
        # (36 unchanged attributes hidden)

      ~ security_and_analysis {
          ~ advanced_security {
              - status = "enabled" -> null
            }

          ~ secret_scanning_push_protection {
              ~ status = "enabled" -> "disabled"
            }

            # (1 unchanged block hidden)
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # github_organization_settings.organization will be updated in-place
  ~ resource "github_organization_settings" "organization" {
      ~ advanced_security_enabled_for_new_repositories               = false -> true
        id                                                           = "122202585"
      ~ secret_scanning_push_protection_enabled_for_new_repositories = false -> true
        # (21 unchanged attributes hidden)
    }

  # gitlab_project.repositories[".github"] will be replaced due to changes in replace_triggered_by
-/+ resource "gitlab_project" "repositories" {
      ~ allow_merge_on_skipped_pipeline                  = false -> (known after apply)
      ~ analytics_access_level                           = "enabled" -> (known after apply)
      - approvals_before_merge                           = 0 -> null
      - archived                                         = false -> null
      ~ auto_cancel_pending_pipelines                    = "enabled" -> (known after apply)
      ~ auto_devops_deploy_strategy                      = "continuous" -> (known after apply)
      ~ auto_devops_enabled                              = false -> (known after apply)
      ~ autoclose_referenced_issues                      = true -> (known after apply)
      + avatar_hash                                      = (known after apply)
      + avatar_url                                       = (known after apply)
      ~ build_git_strategy                               = "fetch" -> (known after apply)
      ~ build_timeout                                    = 3600 -> (known after apply)
      ~ builds_access_level                              = "enabled" -> (known after apply)
      ~ ci_default_git_depth                             = 20 -> (known after apply)
      ~ ci_forward_deployment_enabled                    = true -> (known after apply)
      ~ ci_separated_caches                              = true -> (known after apply)
      ~ container_registry_access_level                  = "enabled" -> (known after apply)
      ~ container_registry_enabled                       = true -> (known after apply)
      ~ default_branch                                   = "main" -> (known after apply)
      ~ description                                      = "Organization readme [mirror of https://github.com/shishifubing/.github] [2023-02-18T12:29:36Z]" -> (known after apply)
      - emails_disabled                                  = false -> null
      - forked_from_project_id                           = 0 -> null
      ~ forking_access_level                             = "enabled" -> (known after apply)
      ~ http_url_to_repo                                 = "https://gitlab.com/shishifubing/dot-github.git" -> (known after apply)
      ~ id                                               = "43640092" -> (known after apply)
      + import_url                                       = "https://github.com/shishifubing/.github.git"
      ~ issues_access_level                              = "enabled" -> (known after apply)
      ~ issues_enabled                                   = true -> (known after apply)
      ~ lfs_enabled                                      = true -> (known after apply)
      ~ merge_method                                     = "merge" -> (known after apply)
      ~ merge_pipelines_enabled                          = false -> (known after apply)
      ~ merge_requests_access_level                      = "enabled" -> (known after apply)
      ~ merge_requests_enabled                           = true -> (known after apply)
      ~ merge_trains_enabled                             = false -> (known after apply)
      - mirror                                           = false -> null
      ~ mirror_overwrites_diverged_branches              = false -> (known after apply)
      ~ mirror_trigger_builds                            = false -> (known after apply)
        name                                             = "dot-github"
      ~ only_allow_merge_if_all_discussions_are_resolved = false -> (known after apply)
      ~ only_allow_merge_if_pipeline_succeeds            = false -> (known after apply)
      ~ only_mirror_protected_branches                   = false -> (known after apply)
      ~ operations_access_level                          = "enabled" -> (known after apply)
      ~ packages_enabled                                 = true -> (known after apply)
      ~ pages_access_level                               = "enabled" -> (known after apply)
      - path                                             = "dot-github" -> null
      ~ path_with_namespace                              = "shishifubing/dot-github" -> (known after apply)
      ~ pipelines_enabled                                = true -> (known after apply)
      ~ printing_merge_request_link_enabled              = true -> (known after apply)
      ~ public_builds                                    = true -> (known after apply)
      ~ remove_source_branch_after_merge                 = true -> (known after apply)
      ~ repository_access_level                          = "enabled" -> (known after apply)
      + repository_storage                               = (known after apply)
      ~ request_access_enabled                           = true -> (known after apply)
      ~ requirements_access_level                        = "enabled" -> (known after apply)
      - resolve_outdated_diff_discussions                = false -> null
      - restrict_user_defined_variables                  = false -> null
      ~ runners_token                                    = (sensitive value)
      ~ security_and_compliance_access_level             = "private" -> (known after apply)
      ~ shared_runners_enabled                           = true -> (known after apply)
      ~ snippets_access_level                            = "enabled" -> (known after apply)
      ~ snippets_enabled                                 = true -> (known after apply)
      ~ squash_option                                    = "default_off" -> (known after apply)
      ~ ssh_url_to_repo                                  = "git@gitlab.com:shishifubing/dot-github.git" -> (known after apply)
      ~ tags                                             = [
          - "readme",
          - "readme-profile",
          - "shishifubing",
        ] -> (known after apply)
      ~ web_url                                          = "https://gitlab.com/shishifubing/dot-github" -> (known after apply)
      ~ wiki_access_level                                = "enabled" -> (known after apply)
      ~ wiki_enabled                                     = true -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ container_expiration_policy {
          ~ cadence           = "1d" -> (known after apply)
          ~ enabled           = false -> (known after apply)
          ~ keep_n            = 10 -> (known after apply)
          + name_regex_delete = (known after apply)
          + name_regex_keep   = (known after apply)
          ~ next_run_at       = "2023-02-19T12:29:42Z" -> (known after apply)
          ~ older_than        = "90d" -> (known after apply)
        }

      + push_rules {
          + author_email_regex            = (known after apply)
          + branch_name_regex             = (known after apply)
          + commit_committer_check        = (known after apply)
          + commit_message_negative_regex = (known after apply)
          + commit_message_regex          = (known after apply)
          + deny_delete_tag               = (known after apply)
          + file_name_regex               = (known after apply)
          + max_file_size                 = (known after apply)
          + member_check                  = (known after apply)
          + prevent_secrets               = (known after apply)
          + reject_unsigned_commits       = (known after apply)
        }
    }

  # gitlab_project.repositories["app-android-anki-chinese-flashcards-enricher"] will be replaced due to changes in replace_triggered_by
-/+ resource "gitlab_project" "repositories" {
      ~ allow_merge_on_skipped_pipeline                  = false -> (known after apply)
      ~ analytics_access_level                           = "enabled" -> (known after apply)
      - approvals_before_merge                           = 0 -> null
      - archived                                         = false -> null
      ~ auto_cancel_pending_pipelines                    = "enabled" -> (known after apply)
      ~ auto_devops_deploy_strategy                      = "continuous" -> (known after apply)
      ~ auto_devops_enabled                              = false -> (known after apply)
      ~ autoclose_referenced_issues                      = true -> (known after apply)
      + avatar_hash                                      = (known after apply)
      + avatar_url                                       = (known after apply)
      ~ build_git_strategy                               = "fetch" -> (known after apply)
      ~ build_timeout                                    = 3600 -> (known after apply)
      ~ builds_access_level                              = "enabled" -> (known after apply)
      ~ ci_default_git_depth                             = 20 -> (known after apply)
      ~ ci_forward_deployment_enabled                    = true -> (known after apply)
      ~ ci_separated_caches                              = true -> (known after apply)
      ~ container_registry_access_level                  = "enabled" -> (known after apply)
      ~ container_registry_enabled                       = true -> (known after apply)
      ~ default_branch                                   = "main" -> (known after apply)
      ~ description                                      = "Android app to streamline my Chinese learning workflow [mirror of https://github.com/shishifubing/app-android-anki-chinese-flashcards-enricher] [2023-02-18T12:29:36Z]" -> (known after apply)
      - emails_disabled                                  = false -> null
      - forked_from_project_id                           = 0 -> null
      ~ forking_access_level                             = "enabled" -> (known after apply)
      ~ http_url_to_repo                                 = "https://gitlab.com/shishifubing/app-android-anki-chinese-flashcards-enricher.git" -> (known after apply)
      ~ id                                               = "43640077" -> (known after apply)
      + import_url                                       = "https://github.com/shishifubing/app-android-anki-chinese-flashcards-enricher.git"
      ~ issues_access_level                              = "enabled" -> (known after apply)
      ~ issues_enabled                                   = true -> (known after apply)
      ~ lfs_enabled                                      = true -> (known after apply)
      ~ merge_method                                     = "merge" -> (known after apply)
      ~ merge_pipelines_enabled                          = false -> (known after apply)
      ~ merge_requests_access_level                      = "enabled" -> (known after apply)
      ~ merge_requests_enabled                           = true -> (known after apply)
      ~ merge_trains_enabled                             = false -> (known after apply)
      - mirror                                           = false -> null
      ~ mirror_overwrites_diverged_branches              = false -> (known after apply)
      ~ mirror_trigger_builds                            = false -> (known after apply)
        name                                             = "app-android-anki-chinese-flashcards-enricher"
      ~ only_allow_merge_if_all_discussions_are_resolved = false -> (known after apply)
      ~ only_allow_merge_if_pipeline_succeeds            = false -> (known after apply)
      ~ only_mirror_protected_branches                   = false -> (known after apply)
      ~ operations_access_level                          = "enabled" -> (known after apply)
      ~ packages_enabled                                 = true -> (known after apply)
      ~ pages_access_level                               = "enabled" -> (known after apply)
      - path                                             = "app-android-anki-chinese-flashcards-enricher" -> null
      ~ path_with_namespace                              = "shishifubing/app-android-anki-chinese-flashcards-enricher" -> (known after apply)
      ~ pipelines_enabled                                = true -> (known after apply)
      ~ printing_merge_request_link_enabled              = true -> (known after apply)
      ~ public_builds                                    = true -> (known after apply)
      ~ remove_source_branch_after_merge                 = true -> (known after apply)
      ~ repository_access_level                          = "enabled" -> (known after apply)
      + repository_storage                               = (known after apply)
      ~ request_access_enabled                           = true -> (known after apply)
      ~ requirements_access_level                        = "enabled" -> (known after apply)
      - resolve_outdated_diff_discussions                = false -> null
      - restrict_user_defined_variables                  = false -> null
      ~ runners_token                                    = (sensitive value)
      ~ security_and_compliance_access_level             = "private" -> (known after apply)
      ~ shared_runners_enabled                           = true -> (known after apply)
      ~ snippets_access_level                            = "enabled" -> (known after apply)
      ~ snippets_enabled                                 = true -> (known after apply)
      ~ squash_option                                    = "default_off" -> (known after apply)
      ~ ssh_url_to_repo                                  = "git@gitlab.com:shishifubing/app-android-anki-chinese-flashcards-enricher.git" -> (known after apply)
      ~ tags                                             = [
          - "android",
          - "app",
          - "kotlin",
          - "shishifubing",
        ] -> (known after apply)
      ~ web_url                                          = "https://gitlab.com/shishifubing/app-android-anki-chinese-flashcards-enricher" -> (known after apply)
      ~ wiki_access_level                                = "enabled" -> (known after apply)
      ~ wiki_enabled                                     = true -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ container_expiration_policy {
          ~ cadence           = "1d" -> (known after apply)
          ~ enabled           = false -> (known after apply)
          ~ keep_n            = 10 -> (known after apply)
          + name_regex_delete = (known after apply)
          + name_regex_keep   = (known after apply)
          ~ next_run_at       = "2023-02-19T12:29:37Z" -> (known after apply)
          ~ older_than        = "90d" -> (known after apply)
        }

      + push_rules {
          + author_email_regex            = (known after apply)
          + branch_name_regex             = (known after apply)
          + commit_committer_check        = (known after apply)
          + commit_message_negative_regex = (known after apply)
          + commit_message_regex          = (known after apply)
          + deny_delete_tag               = (known after apply)
          + file_name_regex               = (known after apply)
          + max_file_size                 = (known after apply)
          + member_check                  = (known after apply)
          + prevent_secrets               = (known after apply)
          + reject_unsigned_commits       = (known after apply)
        }
    }

  # gitlab_project.repositories["app-cli-autoscroll"] will be replaced due to changes in replace_triggered_by
-/+ resource "gitlab_project" "repositories" {
      ~ allow_merge_on_skipped_pipeline                  = false -> (known after apply)
      ~ analytics_access_level                           = "enabled" -> (known after apply)
      - approvals_before_merge                           = 0 -> null
      - archived                                         = false -> null
      ~ auto_cancel_pending_pipelines                    = "enabled" -> (known after apply)
      ~ auto_devops_deploy_strategy                      = "continuous" -> (known after apply)
      ~ auto_devops_enabled                              = false -> (known after apply)
      ~ autoclose_referenced_issues                      = true -> (known after apply)
      + avatar_hash                                      = (known after apply)
      + avatar_url                                       = (known after apply)
      ~ build_git_strategy                               = "fetch" -> (known after apply)
      ~ build_timeout                                    = 3600 -> (known after apply)
      ~ builds_access_level                              = "enabled" -> (known after apply)
      ~ ci_default_git_depth                             = 20 -> (known after apply)
      ~ ci_forward_deployment_enabled                    = true -> (known after apply)
      ~ ci_separated_caches                              = true -> (known after apply)
      ~ container_registry_access_level                  = "enabled" -> (known after apply)
      ~ container_registry_enabled                       = true -> (known after apply)
      ~ default_branch                                   = "main" -> (known after apply)
      ~ description                                      = "Cross-platform CLI app enabling autoscroll [mirror of https://github.com/shishifubing/app-cli-autoscroll] [2023-02-18T12:29:36Z]" -> (known after apply)
      - emails_disabled                                  = false -> null
      - forked_from_project_id                           = 0 -> null
      ~ forking_access_level                             = "enabled" -> (known after apply)
      ~ http_url_to_repo                                 = "https://gitlab.com/shishifubing/app-cli-autoscroll.git" -> (known after apply)
      ~ id                                               = "43640083" -> (known after apply)
      + import_url                                       = "https://github.com/shishifubing/app-cli-autoscroll.git"
      ~ issues_access_level                              = "enabled" -> (known after apply)
      ~ issues_enabled                                   = true -> (known after apply)
      ~ lfs_enabled                                      = true -> (known after apply)
      ~ merge_method                                     = "merge" -> (known after apply)
      ~ merge_pipelines_enabled                          = false -> (known after apply)
      ~ merge_requests_access_level                      = "enabled" -> (known after apply)
      ~ merge_requests_enabled                           = true -> (known after apply)
      ~ merge_trains_enabled                             = false -> (known after apply)
      - mirror                                           = false -> null
      ~ mirror_overwrites_diverged_branches              = false -> (known after apply)
      ~ mirror_trigger_builds                            = false -> (known after apply)
        name                                             = "app-cli-autoscroll"
      ~ only_allow_merge_if_all_discussions_are_resolved = false -> (known after apply)
      ~ only_allow_merge_if_pipeline_succeeds            = false -> (known after apply)
      ~ only_mirror_protected_branches                   = false -> (known after apply)
      ~ operations_access_level                          = "enabled" -> (known after apply)
      ~ packages_enabled                                 = true -> (known after apply)
      ~ pages_access_level                               = "enabled" -> (known after apply)
      - path                                             = "app-cli-autoscroll" -> null
      ~ path_with_namespace                              = "shishifubing/app-cli-autoscroll" -> (known after apply)
      ~ pipelines_enabled                                = true -> (known after apply)
      ~ printing_merge_request_link_enabled              = true -> (known after apply)
      ~ public_builds                                    = true -> (known after apply)
      ~ remove_source_branch_after_merge                 = true -> (known after apply)
      ~ repository_access_level                          = "enabled" -> (known after apply)
      + repository_storage                               = (known after apply)
      ~ request_access_enabled                           = true -> (known after apply)
      ~ requirements_access_level                        = "enabled" -> (known after apply)
      - resolve_outdated_diff_discussions                = false -> null
      - restrict_user_defined_variables                  = false -> null
      ~ runners_token                                    = (sensitive value)
      ~ security_and_compliance_access_level             = "private" -> (known after apply)
      ~ shared_runners_enabled                           = true -> (known after apply)
      ~ snippets_access_level                            = "enabled" -> (known after apply)
      ~ snippets_enabled                                 = true -> (known after apply)
      ~ squash_option                                    = "default_off" -> (known after apply)
      ~ ssh_url_to_repo                                  = "git@gitlab.com:shishifubing/app-cli-autoscroll.git" -> (known after apply)
      ~ tags                                             = [
          - "FINISHED",
          - "PyQt5",
          - "cli-app",
          - "finished-project",
          - "python",
          - "python3",
          - "shishifubing",
        ] -> (known after apply)
      ~ topics                                           = [
          - "FINISHED",
          - "PyQt5",
          + "finished",
          + "pyqt5",
            # (5 unchanged elements hidden)
        ]
      ~ web_url                                          = "https://gitlab.com/shishifubing/app-cli-autoscroll" -> (known after apply)
      ~ wiki_access_level                                = "enabled" -> (known after apply)
      ~ wiki_enabled                                     = true -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ container_expiration_policy {
          ~ cadence           = "1d" -> (known after apply)
          ~ enabled           = false -> (known after apply)
          ~ keep_n            = 10 -> (known after apply)
          + name_regex_delete = (known after apply)
          + name_regex_keep   = (known after apply)
          ~ next_run_at       = "2023-02-19T12:29:37Z" -> (known after apply)
          ~ older_than        = "90d" -> (known after apply)
        }

      + push_rules {
          + author_email_regex            = (known after apply)
          + branch_name_regex             = (known after apply)
          + commit_committer_check        = (known after apply)
          + commit_message_negative_regex = (known after apply)
          + commit_message_regex          = (known after apply)
          + deny_delete_tag               = (known after apply)
          + file_name_regex               = (known after apply)
          + max_file_size                 = (known after apply)
          + member_check                  = (known after apply)
          + prevent_secrets               = (known after apply)
          + reject_unsigned_commits       = (known after apply)
        }
    }

  # gitlab_project.repositories["app-desktop-useless-cpp-gui"] will be replaced due to changes in replace_triggered_by
-/+ resource "gitlab_project" "repositories" {
      ~ allow_merge_on_skipped_pipeline                  = false -> (known after apply)
      ~ analytics_access_level                           = "enabled" -> (known after apply)
      - approvals_before_merge                           = 0 -> null
      - archived                                         = false -> null
      ~ auto_cancel_pending_pipelines                    = "enabled" -> (known after apply)
      ~ auto_devops_deploy_strategy                      = "continuous" -> (known after apply)
      ~ auto_devops_enabled                              = false -> (known after apply)
      ~ autoclose_referenced_issues                      = true -> (known after apply)
      + avatar_hash                                      = (known after apply)
      + avatar_url                                       = (known after apply)
      ~ build_git_strategy                               = "fetch" -> (known after apply)
      ~ build_timeout                                    = 3600 -> (known after apply)
      ~ builds_access_level                              = "enabled" -> (known after apply)
      ~ ci_default_git_depth                             = 20 -> (known after apply)
      ~ ci_forward_deployment_enabled                    = true -> (known after apply)
      ~ ci_separated_caches                              = true -> (known after apply)
      ~ container_registry_access_level                  = "enabled" -> (known after apply)
      ~ container_registry_enabled                       = true -> (known after apply)
      ~ default_branch                                   = "main" -> (known after apply)
      ~ description                                      = "Desktop GUI written using C++ and Qt, it does absolutely nothing [mirror of https://github.com/shishifubing/app-desktop-useless-cpp-gui] [2023-02-18T12:29:36Z]" -> (known after apply)
      - emails_disabled                                  = false -> null
      - forked_from_project_id                           = 0 -> null
      ~ forking_access_level                             = "enabled" -> (known after apply)
      ~ http_url_to_repo                                 = "https://gitlab.com/shishifubing/app-desktop-useless-cpp-gui.git" -> (known after apply)
      ~ id                                               = "43640094" -> (known after apply)
      + import_url                                       = "https://github.com/shishifubing/app-desktop-useless-cpp-gui.git"
      ~ issues_access_level                              = "enabled" -> (known after apply)
      ~ issues_enabled                                   = true -> (known after apply)
      ~ lfs_enabled                                      = true -> (known after apply)
      ~ merge_method                                     = "merge" -> (known after apply)
      ~ merge_pipelines_enabled                          = false -> (known after apply)
      ~ merge_requests_access_level                      = "enabled" -> (known after apply)
      ~ merge_requests_enabled                           = true -> (known after apply)
      ~ merge_trains_enabled                             = false -> (known after apply)
      - mirror                                           = false -> null
      ~ mirror_overwrites_diverged_branches              = false -> (known after apply)
      ~ mirror_trigger_builds                            = false -> (known after apply)
        name                                             = "app-desktop-useless-cpp-gui"
      ~ only_allow_merge_if_all_discussions_are_resolved = false -> (known after apply)
      ~ only_allow_merge_if_pipeline_succeeds            = false -> (known after apply)
      ~ only_mirror_protected_branches                   = false -> (known after apply)
      ~ operations_access_level                          = "enabled" -> (known after apply)
      ~ packages_enabled                                 = true -> (known after apply)
      ~ pages_access_level                               = "enabled" -> (known after apply)
      - path                                             = "app-desktop-useless-cpp-gui" -> null
      ~ path_with_namespace                              = "shishifubing/app-desktop-useless-cpp-gui" -> (known after apply)
      ~ pipelines_enabled                                = true -> (known after apply)
      ~ printing_merge_request_link_enabled              = true -> (known after apply)
      ~ public_builds                                    = true -> (known after apply)
      ~ remove_source_branch_after_merge                 = true -> (known after apply)
      ~ repository_access_level                          = "enabled" -> (known after apply)
      + repository_storage                               = (known after apply)
      ~ request_access_enabled                           = true -> (known after apply)
      ~ requirements_access_level                        = "enabled" -> (known after apply)
      - resolve_outdated_diff_discussions                = false -> null
      - restrict_user_defined_variables                  = false -> null
      ~ runners_token                                    = (sensitive value)
      ~ security_and_compliance_access_level             = "private" -> (known after apply)
      ~ shared_runners_enabled                           = true -> (known after apply)
      ~ snippets_access_level                            = "enabled" -> (known after apply)
      ~ snippets_enabled                                 = true -> (known after apply)
      ~ squash_option                                    = "default_off" -> (known after apply)
      ~ ssh_url_to_repo                                  = "git@gitlab.com:shishifubing/app-desktop-useless-cpp-gui.git" -> (known after apply)
      ~ tags                                             = [
          - "Qt",
          - "abandoned",
          - "abandoned-project",
          - "appimage",
          - "ci",
          - "cpp",
          - "desktop-app",
          - "gui",
          - "qt5",
          - "shishifubing",
        ] -> (known after apply)
      ~ topics                                           = [
          - "Qt",
          + "qt",
            # (9 unchanged elements hidden)
        ]
      ~ web_url                                          = "https://gitlab.com/shishifubing/app-desktop-useless-cpp-gui" -> (known after apply)
      ~ wiki_access_level                                = "enabled" -> (known after apply)
      ~ wiki_enabled                                     = true -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ container_expiration_policy {
          ~ cadence           = "1d" -> (known after apply)
          ~ enabled           = false -> (known after apply)
          ~ keep_n            = 10 -> (known after apply)
          + name_regex_delete = (known after apply)
          + name_regex_keep   = (known after apply)
          ~ next_run_at       = "2023-02-19T12:29:42Z" -> (known after apply)
          ~ older_than        = "90d" -> (known after apply)
        }

      + push_rules {
          + author_email_regex            = (known after apply)
          + branch_name_regex             = (known after apply)
          + commit_committer_check        = (known after apply)
          + commit_message_negative_regex = (known after apply)
          + commit_message_regex          = (known after apply)
          + deny_delete_tag               = (known after apply)
          + file_name_regex               = (known after apply)
          + max_file_size                 = (known after apply)
          + member_check                  = (known after apply)
          + prevent_secrets               = (known after apply)
          + reject_unsigned_commits       = (known after apply)
        }
    }

  # gitlab_project.repositories["app-web-crawler-book-creator"] will be replaced due to changes in replace_triggered_by
-/+ resource "gitlab_project" "repositories" {
      ~ allow_merge_on_skipped_pipeline                  = false -> (known after apply)
      ~ analytics_access_level                           = "enabled" -> (known after apply)
      - approvals_before_merge                           = 0 -> null
      - archived                                         = false -> null
      ~ auto_cancel_pending_pipelines                    = "enabled" -> (known after apply)
      ~ auto_devops_deploy_strategy                      = "continuous" -> (known after apply)
      ~ auto_devops_enabled                              = false -> (known after apply)
      ~ autoclose_referenced_issues                      = true -> (known after apply)
      + avatar_hash                                      = (known after apply)
      + avatar_url                                       = (known after apply)
      ~ build_git_strategy                               = "fetch" -> (known after apply)
      ~ build_timeout                                    = 3600 -> (known after apply)
      ~ builds_access_level                              = "enabled" -> (known after apply)
      ~ ci_default_git_depth                             = 20 -> (known after apply)
      ~ ci_forward_deployment_enabled                    = true -> (known after apply)
      ~ ci_separated_caches                              = true -> (known after apply)
      ~ container_registry_access_level                  = "enabled" -> (known after apply)
      ~ container_registry_enabled                       = true -> (known after apply)
      ~ default_branch                                   = "main" -> (known after apply)
      ~ description                                      = "Web scraper I was building in java a long time ago and  started remaking using Django [mirror of https://github.com/shishifubing/app-web-crawler-book-creator] [2023-02-18T12:29:36Z]" -> (known after apply)
      - emails_disabled                                  = false -> null
      - forked_from_project_id                           = 0 -> null
      ~ forking_access_level                             = "enabled" -> (known after apply)
      ~ http_url_to_repo                                 = "https://gitlab.com/shishifubing/app-web-crawler-book-creator.git" -> (known after apply)
      ~ id                                               = "43640097" -> (known after apply)
      + import_url                                       = "https://github.com/shishifubing/app-web-crawler-book-creator.git"
      ~ issues_access_level                              = "enabled" -> (known after apply)
      ~ issues_enabled                                   = true -> (known after apply)
      ~ lfs_enabled                                      = true -> (known after apply)
      ~ merge_method                                     = "merge" -> (known after apply)
      ~ merge_pipelines_enabled                          = false -> (known after apply)
      ~ merge_requests_access_level                      = "enabled" -> (known after apply)
      ~ merge_requests_enabled                           = true -> (known after apply)
      ~ merge_trains_enabled                             = false -> (known after apply)
      - mirror                                           = false -> null
      ~ mirror_overwrites_diverged_branches              = false -> (known after apply)
      ~ mirror_trigger_builds                            = false -> (known after apply)
        name                                             = "app-web-crawler-book-creator"
      ~ only_allow_merge_if_all_discussions_are_resolved = false -> (known after apply)
      ~ only_allow_merge_if_pipeline_succeeds            = false -> (known after apply)
      ~ only_mirror_protected_branches                   = false -> (known after apply)
      ~ operations_access_level                          = "enabled" -> (known after apply)
      ~ packages_enabled                                 = true -> (known after apply)
      ~ pages_access_level                               = "enabled" -> (known after apply)
      - path                                             = "app-web-crawler-book-creator" -> null
      ~ path_with_namespace                              = "shishifubing/app-web-crawler-book-creator" -> (known after apply)
      ~ pipelines_enabled                                = true -> (known after apply)
      ~ printing_merge_request_link_enabled              = true -> (known after apply)
      ~ public_builds                                    = true -> (known after apply)
      ~ remove_source_branch_after_merge                 = true -> (known after apply)
      ~ repository_access_level                          = "enabled" -> (known after apply)
      + repository_storage                               = (known after apply)
      ~ request_access_enabled                           = true -> (known after apply)
      ~ requirements_access_level                        = "enabled" -> (known after apply)
      - resolve_outdated_diff_discussions                = false -> null
      - restrict_user_defined_variables                  = false -> null
      ~ runners_token                                    = (sensitive value)
      ~ security_and_compliance_access_level             = "private" -> (known after apply)
      ~ shared_runners_enabled                           = true -> (known after apply)
      ~ snippets_access_level                            = "enabled" -> (known after apply)
      ~ snippets_enabled                                 = true -> (known after apply)
      ~ squash_option                                    = "default_off" -> (known after apply)
      ~ ssh_url_to_repo                                  = "git@gitlab.com:shishifubing/app-web-crawler-book-creator.git" -> (known after apply)
      ~ tags                                             = [
          - "CSS3",
          - "abandoned",
          - "abandoned-project",
          - "app",
          - "css",
          - "django",
          - "html",
          - "html5",
          - "javascript",
          - "python",
          - "python3",
          - "shishifubing",
          - "web-scraping",
          - "webapp",
        ] -> (known after apply)
      ~ topics                                           = [
          - "CSS3",
          + "css3",
            # (13 unchanged elements hidden)
        ]
      ~ web_url                                          = "https://gitlab.com/shishifubing/app-web-crawler-book-creator" -> (known after apply)
      ~ wiki_access_level                                = "enabled" -> (known after apply)
      ~ wiki_enabled                                     = true -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ container_expiration_policy {
          ~ cadence           = "1d" -> (known after apply)
          ~ enabled           = false -> (known after apply)
          ~ keep_n            = 10 -> (known after apply)
          + name_regex_delete = (known after apply)
          + name_regex_keep   = (known after apply)
          ~ next_run_at       = "2023-02-19T12:29:43Z" -> (known after apply)
          ~ older_than        = "90d" -> (known after apply)
        }

      + push_rules {
          + author_email_regex            = (known after apply)
          + branch_name_regex             = (known after apply)
          + commit_committer_check        = (known after apply)
          + commit_message_negative_regex = (known after apply)
          + commit_message_regex          = (known after apply)
          + deny_delete_tag               = (known after apply)
          + file_name_regex               = (known after apply)
          + max_file_size                 = (known after apply)
          + member_check                  = (known after apply)
          + prevent_secrets               = (known after apply)
          + reject_unsigned_commits       = (known after apply)
        }
    }

  # gitlab_project.repositories["app-web-django-assignment"] will be replaced due to changes in replace_triggered_by
-/+ resource "gitlab_project" "repositories" {
      ~ allow_merge_on_skipped_pipeline                  = false -> (known after apply)
      ~ analytics_access_level                           = "enabled" -> (known after apply)
      - approvals_before_merge                           = 0 -> null
      - archived                                         = false -> null
      ~ auto_cancel_pending_pipelines                    = "enabled" -> (known after apply)
      ~ auto_devops_deploy_strategy                      = "continuous" -> (known after apply)
      ~ auto_devops_enabled                              = false -> (known after apply)
      ~ autoclose_referenced_issues                      = true -> (known after apply)
      + avatar_hash                                      = (known after apply)
      + avatar_url                                       = (known after apply)
      ~ build_git_strategy                               = "fetch" -> (known after apply)
      ~ build_timeout                                    = 3600 -> (known after apply)
      ~ builds_access_level                              = "enabled" -> (known after apply)
      ~ ci_default_git_depth                             = 20 -> (known after apply)
      ~ ci_forward_deployment_enabled                    = true -> (known after apply)
      ~ ci_separated_caches                              = true -> (known after apply)
      ~ container_registry_access_level                  = "enabled" -> (known after apply)
      ~ container_registry_enabled                       = true -> (known after apply)
      ~ default_branch                                   = "main" -> (known after apply)
      ~ description                                      = "SSR web app I built for a Fullstack Python Web Developer course [mirror of https://github.com/shishifubing/app-web-django-assignment] [2023-02-18T12:29:36Z]" -> (known after apply)
      - emails_disabled                                  = false -> null
      - forked_from_project_id                           = 0 -> null
      ~ forking_access_level                             = "enabled" -> (known after apply)
      ~ http_url_to_repo                                 = "https://gitlab.com/shishifubing/app-web-django-assignment.git" -> (known after apply)
      ~ id                                               = "43640096" -> (known after apply)
      + import_url                                       = "https://github.com/shishifubing/app-web-django-assignment.git"
      ~ issues_access_level                              = "enabled" -> (known after apply)
      ~ issues_enabled                                   = true -> (known after apply)
      ~ lfs_enabled                                      = true -> (known after apply)
      ~ merge_method                                     = "merge" -> (known after apply)
      ~ merge_pipelines_enabled                          = false -> (known after apply)
      ~ merge_requests_access_level                      = "enabled" -> (known after apply)
      ~ merge_requests_enabled                           = true -> (known after apply)
      ~ merge_trains_enabled                             = false -> (known after apply)
      - mirror                                           = false -> null
      ~ mirror_overwrites_diverged_branches              = false -> (known after apply)
      ~ mirror_trigger_builds                            = false -> (known after apply)
        name                                             = "app-web-django-assignment"
      ~ only_allow_merge_if_all_discussions_are_resolved = false -> (known after apply)
      ~ only_allow_merge_if_pipeline_succeeds            = false -> (known after apply)
      ~ only_mirror_protected_branches                   = false -> (known after apply)
      ~ operations_access_level                          = "enabled" -> (known after apply)
      ~ packages_enabled                                 = true -> (known after apply)
      ~ pages_access_level                               = "enabled" -> (known after apply)
      - path                                             = "app-web-django-assignment" -> null
      ~ path_with_namespace                              = "shishifubing/app-web-django-assignment" -> (known after apply)
      ~ pipelines_enabled                                = true -> (known after apply)
      ~ printing_merge_request_link_enabled              = true -> (known after apply)
      ~ public_builds                                    = true -> (known after apply)
      ~ remove_source_branch_after_merge                 = true -> (known after apply)
      ~ repository_access_level                          = "enabled" -> (known after apply)
      + repository_storage                               = (known after apply)
      ~ request_access_enabled                           = true -> (known after apply)
      ~ requirements_access_level                        = "enabled" -> (known after apply)
      - resolve_outdated_diff_discussions                = false -> null
      - restrict_user_defined_variables                  = false -> null
      ~ runners_token                                    = (sensitive value)
      ~ security_and_compliance_access_level             = "private" -> (known after apply)
      ~ shared_runners_enabled                           = true -> (known after apply)
      ~ snippets_access_level                            = "enabled" -> (known after apply)
      ~ snippets_enabled                                 = true -> (known after apply)
      ~ squash_option                                    = "default_off" -> (known after apply)
      ~ ssh_url_to_repo                                  = "git@gitlab.com:shishifubing/app-web-django-assignment.git" -> (known after apply)
      ~ tags                                             = [
          - "CSS3",
          - "FINISHED",
          - "SSR",
          - "app",
          - "bootstrap",
          - "css",
          - "django",
          - "finished-project",
          - "html",
          - "html5",
          - "javascript",
          - "python",
          - "python3",
          - "shishifubing",
          - "webapp",
        ] -> (known after apply)
      ~ topics                                           = [
          - "CSS3",
          - "FINISHED",
          - "SSR",
          + "css3",
          + "finished",
          + "ssr",
            # (12 unchanged elements hidden)
        ]
      ~ web_url                                          = "https://gitlab.com/shishifubing/app-web-django-assignment" -> (known after apply)
      ~ wiki_access_level                                = "enabled" -> (known after apply)
      ~ wiki_enabled                                     = true -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ container_expiration_policy {
          ~ cadence           = "1d" -> (known after apply)
          ~ enabled           = false -> (known after apply)
          ~ keep_n            = 10 -> (known after apply)
          + name_regex_delete = (known after apply)
          + name_regex_keep   = (known after apply)
          ~ next_run_at       = "2023-02-19T12:29:42Z" -> (known after apply)
          ~ older_than        = "90d" -> (known after apply)
        }

      + push_rules {
          + author_email_regex            = (known after apply)
          + branch_name_regex             = (known after apply)
          + commit_committer_check        = (known after apply)
          + commit_message_negative_regex = (known after apply)
          + commit_message_regex          = (known after apply)
          + deny_delete_tag               = (known after apply)
          + file_name_regex               = (known after apply)
          + max_file_size                 = (known after apply)
          + member_check                  = (known after apply)
          + prevent_secrets               = (known after apply)
          + reject_unsigned_commits       = (known after apply)
        }
    }

  # gitlab_project.repositories["app-web-tianyi"] will be replaced due to changes in replace_triggered_by
-/+ resource "gitlab_project" "repositories" {
      ~ allow_merge_on_skipped_pipeline                  = false -> (known after apply)
      ~ analytics_access_level                           = "enabled" -> (known after apply)
      - approvals_before_merge                           = 0 -> null
      - archived                                         = false -> null
      ~ auto_cancel_pending_pipelines                    = "enabled" -> (known after apply)
      ~ auto_devops_deploy_strategy                      = "continuous" -> (known after apply)
      ~ auto_devops_enabled                              = false -> (known after apply)
      ~ autoclose_referenced_issues                      = true -> (known after apply)
      + avatar_hash                                      = (known after apply)
      + avatar_url                                       = (known after apply)
      ~ build_git_strategy                               = "fetch" -> (known after apply)
      ~ build_timeout                                    = 3600 -> (known after apply)
      ~ builds_access_level                              = "enabled" -> (known after apply)
      ~ ci_default_git_depth                             = 20 -> (known after apply)
      ~ ci_forward_deployment_enabled                    = true -> (known after apply)
      ~ ci_separated_caches                              = true -> (known after apply)
      ~ container_registry_access_level                  = "enabled" -> (known after apply)
      ~ container_registry_enabled                       = true -> (known after apply)
      ~ default_branch                                   = "main" -> (known after apply)
      ~ description                                      = "SPA CI/CD app [mirror of https://github.com/shishifubing/app-web-tianyi] [2023-02-18T12:29:36Z]" -> (known after apply)
      - emails_disabled                                  = false -> null
      - forked_from_project_id                           = 0 -> null
      ~ forking_access_level                             = "enabled" -> (known after apply)
      ~ http_url_to_repo                                 = "https://gitlab.com/shishifubing/app-web-tianyi.git" -> (known after apply)
      ~ id                                               = "43640091" -> (known after apply)
      + import_url                                       = "https://github.com/shishifubing/app-web-tianyi.git"
      ~ issues_access_level                              = "enabled" -> (known after apply)
      ~ issues_enabled                                   = true -> (known after apply)
      ~ lfs_enabled                                      = true -> (known after apply)
      ~ merge_method                                     = "merge" -> (known after apply)
      ~ merge_pipelines_enabled                          = false -> (known after apply)
      ~ merge_requests_access_level                      = "enabled" -> (known after apply)
      ~ merge_requests_enabled                           = true -> (known after apply)
      ~ merge_trains_enabled                             = false -> (known after apply)
      - mirror                                           = false -> null
      ~ mirror_overwrites_diverged_branches              = false -> (known after apply)
      ~ mirror_trigger_builds                            = false -> (known after apply)
        name                                             = "app-web-tianyi"
      ~ only_allow_merge_if_all_discussions_are_resolved = false -> (known after apply)
      ~ only_allow_merge_if_pipeline_succeeds            = false -> (known after apply)
      ~ only_mirror_protected_branches                   = false -> (known after apply)
      ~ operations_access_level                          = "enabled" -> (known after apply)
      ~ packages_enabled                                 = true -> (known after apply)
      ~ pages_access_level                               = "enabled" -> (known after apply)
      - path                                             = "app-web-tianyi" -> null
      ~ path_with_namespace                              = "shishifubing/app-web-tianyi" -> (known after apply)
      ~ pipelines_enabled                                = true -> (known after apply)
      ~ printing_merge_request_link_enabled              = true -> (known after apply)
      ~ public_builds                                    = true -> (known after apply)
      ~ remove_source_branch_after_merge                 = true -> (known after apply)
      ~ repository_access_level                          = "enabled" -> (known after apply)
      + repository_storage                               = (known after apply)
      ~ request_access_enabled                           = true -> (known after apply)
      ~ requirements_access_level                        = "enabled" -> (known after apply)
      - resolve_outdated_diff_discussions                = false -> null
      - restrict_user_defined_variables                  = false -> null
      ~ runners_token                                    = (sensitive value)
      ~ security_and_compliance_access_level             = "private" -> (known after apply)
      ~ shared_runners_enabled                           = true -> (known after apply)
      ~ snippets_access_level                            = "enabled" -> (known after apply)
      ~ snippets_enabled                                 = true -> (known after apply)
      ~ squash_option                                    = "default_off" -> (known after apply)
      ~ ssh_url_to_repo                                  = "git@gitlab.com:shishifubing/app-web-tianyi.git" -> (known after apply)
      ~ tags                                             = [
          - "CSS3",
          - "VueJS3",
          - "abandoned",
          - "abandoned-project",
          - "app",
          - "css",
          - "go",
          - "golang",
          - "html",
          - "html5",
          - "javascript",
          - "postgresql",
          - "redis",
          - "scss",
          - "shishifubing",
          - "spa",
          - "vuejs",
          - "vuex-store",
          - "webapp",
        ] -> (known after apply)
      ~ topics                                           = [
          - "CSS3",
          - "VueJS3",
          + "css3",
          + "vuejs3",
            # (17 unchanged elements hidden)
        ]
      ~ web_url                                          = "https://gitlab.com/shishifubing/app-web-tianyi" -> (known after apply)
      ~ wiki_access_level                                = "enabled" -> (known after apply)
      ~ wiki_enabled                                     = true -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ container_expiration_policy {
          ~ cadence           = "1d" -> (known after apply)
          ~ enabled           = false -> (known after apply)
          ~ keep_n            = 10 -> (known after apply)
          + name_regex_delete = (known after apply)
          + name_regex_keep   = (known after apply)
          ~ next_run_at       = "2023-02-19T12:29:42Z" -> (known after apply)
          ~ older_than        = "90d" -> (known after apply)
        }

      + push_rules {
          + author_email_regex            = (known after apply)
          + branch_name_regex             = (known after apply)
          + commit_committer_check        = (known after apply)
          + commit_message_negative_regex = (known after apply)
          + commit_message_regex          = (known after apply)
          + deny_delete_tag               = (known after apply)
          + file_name_regex               = (known after apply)
          + max_file_size                 = (known after apply)
          + member_check                  = (known after apply)
          + prevent_secrets               = (known after apply)
          + reject_unsigned_commits       = (known after apply)
        }
    }

  # gitlab_project.repositories["ci-actions-common"] will be replaced due to changes in replace_triggered_by
-/+ resource "gitlab_project" "repositories" {
      ~ allow_merge_on_skipped_pipeline                  = false -> (known after apply)
      ~ analytics_access_level                           = "enabled" -> (known after apply)
      - approvals_before_merge                           = 0 -> null
      - archived                                         = false -> null
      ~ auto_cancel_pending_pipelines                    = "enabled" -> (known after apply)
      ~ auto_devops_deploy_strategy                      = "continuous" -> (known after apply)
      ~ auto_devops_enabled                              = false -> (known after apply)
      ~ autoclose_referenced_issues                      = true -> (known after apply)
      + avatar_hash                                      = (known after apply)
      + avatar_url                                       = (known after apply)
      ~ build_git_strategy                               = "fetch" -> (known after apply)
      ~ build_timeout                                    = 3600 -> (known after apply)
      ~ builds_access_level                              = "enabled" -> (known after apply)
      ~ ci_default_git_depth                             = 20 -> (known after apply)
      ~ ci_forward_deployment_enabled                    = true -> (known after apply)
      ~ ci_separated_caches                              = true -> (known after apply)
      ~ container_registry_access_level                  = "enabled" -> (known after apply)
      ~ container_registry_enabled                       = true -> (known after apply)
      ~ default_branch                                   = "main" -> (known after apply)
      ~ description                                      = "Github actions for shishifubing repositories [mirror of https://github.com/shishifubing/ci-actions-common] [2023-02-18T12:29:36Z]" -> (known after apply)
      - emails_disabled                                  = false -> null
      - forked_from_project_id                           = 0 -> null
      ~ forking_access_level                             = "enabled" -> (known after apply)
      ~ http_url_to_repo                                 = "https://gitlab.com/shishifubing/ci-actions-common.git" -> (known after apply)
      ~ id                                               = "43640076" -> (known after apply)
      + import_url                                       = "https://github.com/shishifubing/ci-actions-common.git"
      ~ issues_access_level                              = "enabled" -> (known after apply)
      ~ issues_enabled                                   = true -> (known after apply)
      ~ lfs_enabled                                      = true -> (known after apply)
      ~ merge_method                                     = "merge" -> (known after apply)
      ~ merge_pipelines_enabled                          = false -> (known after apply)
      ~ merge_requests_access_level                      = "enabled" -> (known after apply)
      ~ merge_requests_enabled                           = true -> (known after apply)
      ~ merge_trains_enabled                             = false -> (known after apply)
      - mirror                                           = false -> null
      ~ mirror_overwrites_diverged_branches              = false -> (known after apply)
      ~ mirror_trigger_builds                            = false -> (known after apply)
        name                                             = "ci-actions-common"
      ~ only_allow_merge_if_all_discussions_are_resolved = false -> (known after apply)
      ~ only_allow_merge_if_pipeline_succeeds            = false -> (known after apply)
      ~ only_mirror_protected_branches                   = false -> (known after apply)
      ~ operations_access_level                          = "enabled" -> (known after apply)
      ~ packages_enabled                                 = true -> (known after apply)
      ~ pages_access_level                               = "enabled" -> (known after apply)
      - path                                             = "ci-actions-common" -> null
      ~ path_with_namespace                              = "shishifubing/ci-actions-common" -> (known after apply)
      ~ pipelines_enabled                                = true -> (known after apply)
      ~ printing_merge_request_link_enabled              = true -> (known after apply)
      ~ public_builds                                    = true -> (known after apply)
      ~ remove_source_branch_after_merge                 = true -> (known after apply)
      ~ repository_access_level                          = "enabled" -> (known after apply)
      + repository_storage                               = (known after apply)
      ~ request_access_enabled                           = true -> (known after apply)
      ~ requirements_access_level                        = "enabled" -> (known after apply)
      - resolve_outdated_diff_discussions                = false -> null
      - restrict_user_defined_variables                  = false -> null
      ~ runners_token                                    = (sensitive value)
      ~ security_and_compliance_access_level             = "private" -> (known after apply)
      ~ shared_runners_enabled                           = true -> (known after apply)
      ~ snippets_access_level                            = "enabled" -> (known after apply)
      ~ snippets_enabled                                 = true -> (known after apply)
      ~ squash_option                                    = "default_off" -> (known after apply)
      ~ ssh_url_to_repo                                  = "git@gitlab.com:shishifubing/ci-actions-common.git" -> (known after apply)
      ~ tags                                             = [
          - "action",
          - "actions",
          - "github-action",
          - "github-actions",
          - "shishifubing",
        ] -> (known after apply)
      ~ web_url                                          = "https://gitlab.com/shishifubing/ci-actions-common" -> (known after apply)
      ~ wiki_access_level                                = "enabled" -> (known after apply)
      ~ wiki_enabled                                     = true -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ container_expiration_policy {
          ~ cadence           = "1d" -> (known after apply)
          ~ enabled           = false -> (known after apply)
          ~ keep_n            = 10 -> (known after apply)
          + name_regex_delete = (known after apply)
          + name_regex_keep   = (known after apply)
          ~ next_run_at       = "2023-02-19T12:29:37Z" -> (known after apply)
     ...
```

</details>
Output is too long and was truncated. You can read full Plan in <a href="https://github.com/shishifubing/infra-repos-shishifubing/actions/runs/4217381724">Actions</a>.<br /><br />

Pushed by: @tiandaoburen
Action: `pull_request`
